app/controllers/authors_controller.rb

SELECT COUNT(*) FROM "authors"
---
  def zero_authors_or_authenticated
    unless Author.count.zero? || current_user